#!/usr/bin/env python
# -*- coding: utf-8 -*-

#__title__ = '判断控制器'
#__author__ = 'yupeng'
#__mtime__ = '2019/9/4'


'''
            if 是一个分支语句
if(条件):
    代码块
else:
    代码块

'''

'''
if(条件):
    print("")

'''

# 小明去超市买东西，如果遇到卖西瓜，就买一个
a = 1 # 1代表有西瓜  0代表没西瓜
if(a == 0):
    print("买一个西瓜")
else:
    print("回家吃冰棍吧")

# 今天去打篮球吗  q 代表去  b 代表不去
a = 1 # 1 代表去  2 代表不去
if(a == 2):
    print("真的很nice")
else:
    print("好烦躁")

# 小花今天期末成绩下来了，他考了91分 老师给了一个成绩分类 小于60为不及格 60-90为良好 80以上为优秀 100为特优
h = 91
if(h == 100):
    print("小花成绩特优")
elif (h >= 90):
    print("小花成绩优秀")
elif(h >= 60):
    print("小花成绩良好")
else:
    print("小花成绩不合格")







